# Pandas Serisi Olusturmak

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.Series([99,112,70,-3,11])  # Degerleri index ile beraber tutar internal

0     99
1    112
2     70
3     -3
4     11
dtype: int64

In [4]:
seri = pd.Series([99,112,70,-3,11])
type(seri)

pandas.core.series.Series

In [6]:
seri.axes # index bilgisine ulas, index 5'e kadar 5 dahil degil

[RangeIndex(start=0, stop=5, step=1)]

In [7]:
seri.dtype

dtype('int64')

In [9]:
seri.ndim # Boyut

1

In [10]:
seri.values # index olmadan sadece veriler ulasmak

array([ 99, 112,  70,  -3,  11])

In [12]:
seri.head()

0     99
1    112
2     70
3     -3
4     11
dtype: int64

In [14]:
seri.tail(3)

2    70
3    -3
4    11
dtype: int64

## index isimlendirmesi

In [18]:
seri = pd.Series([99,112,70,-3,11])
seri

0     99
1    112
2     70
3     -3
4     11
dtype: int64

seri = pd.Series([99,112,70,-3,11], index = [1,3,5,7,9])
seri

In [24]:
seri = pd.Series([99,112,70,-3,11], index = ['a', 3, 'c', 7,9])
seri

a     99
3    112
c     70
7     -3
9     11
dtype: int64

In [25]:
seri['a']

99

In [27]:
seri['a':'c']

a     99
3    112
c     70
dtype: int64

## Sozluk uzerinde Liste Olusturmak

In [28]:
sozluk = {'reg':10, 'log':11, 'cart':12}

In [29]:
seri = pd.Series(sozluk)
seri

reg     10
log     11
cart    12
dtype: int64

In [31]:
seri['log':]

log     11
cart    12
dtype: int64

## Iki seriyi birlestirmek (concat)

In [39]:
seri

reg     10
log     11
cart    12
dtype: int64

In [42]:
seri2 = pd.Series({'reg':1999, 'log':77, 'cart':555})
seri2

reg     1999
log       77
cart     555
dtype: int64

In [43]:
pd.concat([seri, seri2])

reg       10
log       11
cart      12
reg     1999
log       77
cart     555
dtype: int64

In [44]:
pd.concat([seri, seri2], axis = 1)

       0     1
reg   10  1999
log   11    77
cart  12   555

In [45]:
#?pd.concat ====> Concatenate

# Eleman Birlestirme

In [49]:
a = np.array([1,2,33,444,75])
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int64

In [51]:
seri[0]

1

In [52]:
seri[0:3]

0     1
1     2
2    33
dtype: int64

In [54]:
seri = pd.Series([1221, 200, 150, 99],
               index = ['reg', 'log', 'cart', 'rf'])

In [56]:
seri

reg     1221
log      200
cart     150
rf        99
dtype: int64

In [58]:
seri.index

Index(['reg', 'log', 'cart', 'rf'], dtype='object')

In [59]:
seri.axes

[Index(['reg', 'log', 'cart', 'rf'], dtype='object')]

In [60]:
seri.keys

<bound method Series.keys of reg     1221
log      200
cart     150
rf        99
dtype: int64>

In [61]:
list(seri.items())

[('reg', 1221), ('log', 200), ('cart', 150), ('rf', 99)]

In [66]:
seri2 = pd.Series([999, 222, 777, 888],
               index = ['reg', 'log', 'cart', 'rf'])

In [67]:
s1 = pd.concat([seri, seri2], axis = 1)
s1

         0    1
reg   1221  999
log    200  222
cart   150  777
rf      99  888

In [68]:
list(s1.items())

[(0,
  reg     1221
  log      200
  cart     150
  rf        99
  Name: 0, dtype: int64),
 (1,
  reg     999
  log     222
  cart    777
  rf      888
  Name: 1, dtype: int64)]

In [69]:
s1[0]

reg     1221
log      200
cart     150
rf        99
Name: 0, dtype: int64

In [73]:
s1[0][0] # s1[0,0] ====> hata verir !!!!!

1221

## Eleman Sorgulama

In [78]:
'reg' in seri

True

In [79]:
'a' in seri

False

In [80]:
seri['reg']

1221

In [81]:
seri[['reg', 'rf']]

reg    1221
rf       99
dtype: int64

In [82]:
## Eleman degistirme

In [83]:
seri['reg']

1221

In [85]:
seri['reg'] = 'Abdullah'
seri['reg']

'Abdullah'

# Pandas DataFrame Olusturma

In [86]:
l = [1,2,39,67,90]
l

[1, 2, 39, 67, 90]

In [89]:
pd.DataFrame(l, columns = ['degisken_ismi'])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [90]:
m = np.arange(1,10).reshape(3,3)
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [92]:
pd.DataFrame(m, columns = ['var1', 'var2', 'var3'])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

## df Isimlendirme

In [93]:
df = pd.DataFrame(m, columns = ['var1', 'var2', 'var3'])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [94]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

## Kolon Adi Degistirme

In [95]:
df.columns = ('deg1', 'deg2', 'deg3')
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [96]:
type(df)

pandas.core.frame.DataFrame

In [97]:
df.axes  # Satir ve Sutun bilgisine ulasilir

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [98]:
df.ndim

2

In [99]:
df.shape

(3, 3)

In [100]:
df.size # eleman sayisi

9

In [101]:
df.values #!!!!! Numpy arraya cevirip degerleri verdi

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [116]:
a = np.array([1,2,3,4,5])
b = pd.DataFrame(a, columns = ['deg1'])
b

   deg1
0     1
1     2
2     3
3     4
4     5

In [119]:
b['deg1'][0]

1

# Eleman Islemleri

In [129]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [133]:
sozluk = {'var1':s1, 'var2':s2, 'var3':3}
sozluk

{'var1': array([6, 8, 0, 1, 2]), 'var2': array([5, 7, 3, 4, 7]), 'var3': 3}

In [138]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     6     5     3
1     8     7     3
2     0     3     3
3     1     4     3
4     2     7     3

In [167]:
df[0:1]

   var1  var2  var3
0     6     5     3

# Index Degistirmek

In [168]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [169]:
df.index = ['a', 'b', 'c', 'd', 'e']
df

   var1  var2  var3
a     6     5     3
b     8     7     3
c     0     3     3
d     1     4     3
e     2     7     3

In [171]:
df['c':'e']

   var1  var2  var3
c     0     3     3
d     1     4     3
e     2     7     3

## Silme Islemi

df.drop(0, axis = 0 , inplace = True)

In [173]:
df.drop('a', axis = 0) # Dikkat kalici silmez !!!!!

   var1  var2  var3
b     8     7     3
c     0     3     3
d     1     4     3
e     2     7     3

In [174]:
df # ana DataFrame ayni duruyor

   var1  var2  var3
a     6     5     3
b     8     7     3
c     0     3     3
d     1     4     3
e     2     7     3

In [175]:
df.drop('a', axis = 0, inplace = True) 
df

   var1  var2  var3
b     8     7     3
c     0     3     3
d     1     4     3
e     2     7     3

In [176]:
# Fancy ile Silme

In [177]:
l = ['c', 'd']
df.drop(l, axis = 0)

   var1  var2  var3
b     8     7     3
e     2     7     3

## in (DataFrame icinde mi ? Sorgulama)

In [178]:
'var1' in df

True

In [181]:
l = ['var1', 'xxx', 'var3']

In [182]:
for i in l:
    print(i in df)

True
False
True

## Yeni Sutun Eklemek ve Silmek (New Column added and deleted)

In [183]:
df

   var1  var2  var3
b     8     7     3
c     0     3     3
d     1     4     3
e     2     7     3

In [185]:
df['var4'] = df['var1'] * df['var2']
df

   var1  var2  var3  var4
b     8     7     3    56
c     0     3     3     0
d     1     4     3     4
e     2     7     3    14

In [186]:
df.drop('var4', axis = 1)

   var1  var2  var3
b     8     7     3
c     0     3     3
d     1     4     3
e     2     7     3

In [188]:
df.drop('var4', axis = 1, inplace = True)
df

   var1  var2  var3
b     8     7     3
c     0     3     3
d     1     4     3
e     2     7     3

In [189]:
l = ['var1', 'var2']
df.drop(l, axis = 1)

   var3
b     3
c     3
d     3
e     3

# Gozlem ve Degisken Secimi : loc & iloc

In [192]:
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ['v1', 'v2', 'v3'])
df

   v1  v2  v3
0  17  11  23
1  26  16  29
2  26  15  27
3   8  18   6
4  29   2  23
5  20  27   2
6  16   2   9
7  12  27   4
8  17   5  24
9  29  19  11

## loc : Tanimlandigi sekli ile secim yapar.

In [201]:
df.loc[0:3] # 3. Indeksi de alirrrrr

   v1  v2  v3
0  17  11  23
1  26  16  29
2  26  15  27
3   8  18   6

## iloc : alisik oldugumuz indeksleme mantigi ile secim yapar.

In [203]:
df.iloc[0:3]  # 3. indeks dahil degildir.

   v1  v2  v3
0  17  11  23
1  26  16  29
2  26  15  27

In [204]:
df.iloc[0,0]

17

In [206]:
# df.loc[0,0]   ======> Hata verir

In [207]:
df.iloc[:3,:2]

   v1  v2
0  17  11
1  26  16
2  26  15

In [210]:
# df.loc[:3,:2]    ======> Hata verir

In [211]:
df.loc[0:3, 'v3']

0    23
1    29
2    27
3     6
Name: v3, dtype: int64

In [213]:
#df.iloc[0:3, 'v3'] =======> Hata verir

In [216]:
df.iloc[0:3]['v3']

0    23
1    29
2    27
Name: v3, dtype: int64

# Kosullu Eleman Islmeleri

In [218]:
df

   v1  v2  v3
0  17  11  23
1  26  16  29
2  26  15  27
3   8  18   6
4  29   2  23
5  20  27   2
6  16   2   9
7  12  27   4
8  17   5  24
9  29  19  11

In [219]:
df['v1']

0    17
1    26
2    26
3     8
4    29
5    20
6    16
7    12
8    17
9    29
Name: v1, dtype: int64

In [223]:
df['v1'][0:3]

0    17
1    26
2    26
Name: v1, dtype: int64

In [224]:
df[0:3]

   v1  v2  v3
0  17  11  23
1  26  16  29
2  26  15  27

In [225]:
df[0:3]['v1']

0    17
1    26
2    26
Name: v1, dtype: int64

In [226]:
df[0:3][['v1', 'v2']] # Fancy islemi yapilir , degilse hata verir

   v1  v2
0  17  11
1  26  16
2  26  15

In [227]:
df.v1

0    17
1    26
2    26
3     8
4    29
5    20
6    16
7    12
8    17
9    29
Name: v1, dtype: int64

In [230]:
df[df.v1 > 20] # =====> Bu DataFrame in tamamidir, kosulu saglayanlardir

   v1  v2  v3
1  26  16  29
2  26  15  27
4  29   2  23
9  29  19  11

In [232]:
df[df.v1 > 20]['v1']  # Bu DataFrame in kosulu saglayanlarin v1 stunudur sadece

1    26
2    26
4    29
9    29
Name: v1, dtype: int64

In [233]:
df[(df.v1 > 20) & (df.v3 < 25)]

   v1  v2  v3
4  29   2  23
9  29  19  11

In [236]:
df[(df.v1 > 20) & (df.v3 < 25)][['v2', 'v3']]

   v2  v3
4   2  23
9  19  11

In [248]:
m = np.random.randint(1,30, size  = (5,3))
df1 = pd.DataFrame(m, columns = ['c1', 'c2', 'c3'])
df1

   c1  c2  c3
0  12  26  18
1  19  10  18
2  27   7   2
3  21  25  17
4   5  13  19

In [249]:
df2 = df1 + 99
df2

    c1   c2   c3
0  111  125  117
1  118  109  117
2  126  106  101
3  120  124  116
4  104  112  118

# pd.concat([df1,df2], ignore_index = False, join = 'outer')

In [251]:
pd.concat([df1,df2])

    c1   c2   c3
0   12   26   18
1   19   10   18
2   27    7    2
3   21   25   17
4    5   13   19
0  111  125  117
1  118  109  117
2  126  106  101
3  120  124  116
4  104  112  118

In [252]:
?pd.concat

Signature:
pd.concat(
    objs: 'Iterable[NDFrame] | Mapping[Hashable, NDFrame]',
    axis=0,
    join='outer',
    ignore_index: 'bool' = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool' = True,
) -> 'FrameOrSeriesUnion'
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      ~/opt/anaconda3/lib/python3.8/site-packages/pandas/core/reshape/concat.py
Type:      function

## ignore_index = True

In [253]:
pd.concat([df1,df2], ignore_index=False)

    c1   c2   c3
0   12   26   18
1   19   10   18
2   27    7    2
3   21   25   17
4    5   13   19
0  111  125  117
1  118  109  117
2  126  106  101
3  120  124  116
4  104  112  118

In [254]:
pd.concat([df1,df2], ignore_index=True)

    c1   c2   c3
0   12   26   18
1   19   10   18
2   27    7    2
3   21   25   17
4    5   13   19
5  111  125  117
6  118  109  117
7  126  106  101
8  120  124  116
9  104  112  118

In [256]:
df1.columns

Index(['c1', 'c2', 'c3'], dtype='object')

In [257]:
df2.columns

Index(['c1', 'c2', 'c3'], dtype='object')

In [259]:
df2.columns = ['c1', 'c2', 'deg3']
df2

    c1   c2  deg3
0  111  125   117
1  118  109   117
2  126  106   101
3  120  124   116
4  104  112   118

In [260]:
pd.concat([df1,df2])   #========> NaN hatasi olustu

    c1   c2    c3   deg3
0   12   26  18.0    NaN
1   19   10  18.0    NaN
2   27    7   2.0    NaN
3   21   25  17.0    NaN
4    5   13  19.0    NaN
0  111  125   NaN  117.0
1  118  109   NaN  117.0
2  126  106   NaN  101.0
3  120  124   NaN  116.0
4  104  112   NaN  118.0

## join = 'inner' , 'outer'

In [266]:
pd.concat([df1,df2], join = 'inner')

    c1   c2
0   12   26
1   19   10
2   27    7
3   21   25
4    5   13
0  111  125
1  118  109
2  126  106
3  120  124
4  104  112

In [267]:
pd.concat([df1,df2], join = 'outer')

    c1   c2    c3   deg3
0   12   26  18.0    NaN
1   19   10  18.0    NaN
2   27    7   2.0    NaN
3   21   25  17.0    NaN
4    5   13  19.0    NaN
0  111  125   NaN  117.0
1  118  109   NaN  117.0
2  126  106   NaN  101.0
3  120  124   NaN  116.0
4  104  112   NaN  118.0

In [265]:
pd.concat([df1,df2], join = 'inner', ignore_index=True)

    c1   c2
0   12   26
1   19   10
2   27    7
3   21   25
4    5   13
5  111  125
6  118  109
7  126  106
8  120  124
9  104  112

# Ileri Birlestirme Islmeleri

In [11]:
df3 = pd.DataFrame({'calisanlar' : ['Ali', 'Veli', 'Ayse', 'Fatma'],
                   'grup' : ['Muhasebe', 'Muh', 'Muh', 'IK']})
df3

  calisanlar      grup
0        Ali  Muhasebe
1       Veli       Muh
2       Ayse       Muh
3      Fatma        IK

In [12]:
df4 = pd.DataFrame({'calisanlar' : ['Ali', 'Veli', 'Ayse', 'Fatma'],
                   'ilk_giris' : [2010, 2009, 2014, 2019]})
df4

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2009
2       Ayse       2014
3      Fatma       2019

In [13]:
pd.concat([df3,df4], axis = 1, )

  calisanlar      grup calisanlar  ilk_giris
0        Ali  Muhasebe        Ali       2010
1       Veli       Muh       Veli       2009
2       Ayse       Muh       Ayse       2014
3      Fatma        IK      Fatma       2019

In [275]:
?pd.concat

Signature:
pd.concat(
    objs: 'Iterable[NDFrame] | Mapping[Hashable, NDFrame]',
    axis=0,
    join='outer',
    ignore_index: 'bool' = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool' = True,
) -> 'FrameOrSeriesUnion'
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      ~/opt/anaconda3/lib/python3.8/site-packages/pandas/core/reshape/concat.py
Type:      function

## pd._**merge()**_

In [34]:
df_m = pd.merge(df3,df4)
df_m

  calisanlar      grup  ilk_giris
0        Ali  Muhasebe       2010
1       Veli       Muh       2009
2       Ayse       Muh       2014
3      Fatma        IK       2019

In [14]:
pd.merge(df3, df4, on = 'calisanlar')

  calisanlar      grup  ilk_giris
0        Ali  Muhasebe       2010
1       Veli       Muh       2009
2       Ayse       Muh       2014
3      Fatma        IK       2019

In [18]:
?pd.merge

Signature:
pd.merge(
    left: 'DataFrame | Series',
    right: 'DataFrame | Series',
    how: 'str' = 'inner',
    on: 'IndexLabel | None' = None,
    left_on: 'IndexLabel | None' = None,
    right_on: 'IndexLabel | None' = None,
    left_index: 'bool' = False,
    right_index: 'bool' = False,
    sort: 'bool' = False,
    suffixes: 'Suffixes' = ('_x', '_y'),
    copy: 'bool' = True,
    indicator: 'bool' = False,
    validate: 'str | None' = None,
) -> 'DataFrame'
Docstring:
Merge DataFrame or named Series objects with a database-style join.

A named Series object is treated as a DataFrame with a single named column.

The join is done on columns or indexes. If joining columns on
columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
on indexes or indexes on a column or columns, the index will be passed on.
When performing a cross merge, no column specifications to merge on are
allowed.

Parameters
----------
left : DataFrame
right : DataFrame or named Series
    Object to merge with.
how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
    Type of merge to be performed.

    * left: use only keys from left frame, similar to a SQL left outer join;
      preserve key order.
    * right: use only keys from right frame, similar to a SQL right outer join;
      preserve key order.
    * outer: use union of keys from both frames, similar to a SQL full outer
      join; sort keys lexicographically.
    * inner: use intersection of keys from both frames, similar to a SQL inner
      join; preserve the order of the left keys.
    * cross: creates the cartesian product from both frames, preserves the order
      of the left keys.

      .. versionadded:: 1.2.0

on : label or list
    Column or index level names to join on. These must be found in both
    DataFrames. If `on` is None and not merging on indexes then this defaults
    to the intersection of the columns in both DataFrames.
left_on : label or list, or array-like
    Column or index level names to join on in the left DataFrame. Can also
    be an array or list of arrays of the length of the left DataFrame.
    These arrays are treated as if they are columns.
right_on : label or list, or array-like
    Column or index level names to join on in the right DataFrame. Can also
    be an array or list of arrays of the length of the right DataFrame.
    These arrays are treated as if they are columns.
left_index : bool, default False
    Use the index from the left DataFrame as the join key(s). If it is a
    MultiIndex, the number of keys in the other DataFrame (either the index
    or a number of columns) must match the number of levels.
right_index : bool, default False
    Use the index from the right DataFrame as the join key. Same caveats as
    left_index.
sort : bool, default False
    Sort the join keys lexicographically in the result DataFrame. If False,
    the order of the join keys depends on the join type (how keyword).
suffixes : list-like, default is ("_x", "_y")
    A length-2 sequence where each element is optionally a string
    indicating the suffix to add to overlapping column names in
    `left` and `right` respectively. Pass a value of `None` instead
    of a string to indicate that the column name from `left` or
    `right` should be left as-is, with no suffix. At least one of the
    values must not be None.
copy : bool, default True
    If False, avoid copy if possible.
indicator : bool or str, default False
    If True, adds a column to the output DataFrame called "_merge" with
    information on the source of each row. The column can be given a different
    name by providing a string argument. The column will have a Categorical
    type with the value of "left_only" for observations whose merge key only
    appears in the left DataFrame, "right_only" for observations
    whose merge key only appears in the right DataFrame, and "both"
    if the observation's merge key is found in both DataFrames.

validate : str, optional
    If specified, checks if merge is of specified type.

    * "one_to_one" or "1:1": check if merge keys are unique in both
      left and right datasets.
    * "one_to_many" or "1:m": check if merge keys are unique in left
      dataset.
    * "many_to_one" or "m:1": check if merge keys are unique in right
      dataset.
    * "many_to_many" or "m:m": allowed, but does not result in checks.

Returns
-------
DataFrame
    A DataFrame of the two merged objects.

See Also
--------
merge_ordered : Merge with optional filling/interpolation.
merge_asof : Merge on nearest keys.
DataFrame.join : Similar method using indices.

Notes
-----
Support for specifying index levels as the `on`, `left_on`, and
`right_on` parameters was added in version 0.23.0
Support for merging named Series objects was added in version 0.24.0

Examples
--------
>>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [1, 2, 3, 5]})
>>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [5, 6, 7, 8]})
>>> df1
    lkey value
0   foo      1
1   bar      2
2   baz      3
3   foo      5
>>> df2
    rkey value
0   foo      5
1   bar      6
2   baz      7
3   foo      8

Merge df1 and df2 on the lkey and rkey columns. The value columns have
the default suffixes, _x and _y, appended.

>>> df1.merge(df2, left_on='lkey', right_on='rkey')
  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

Merge DataFrames df1 and df2 with specified left and right suffixes
appended to any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey',
...           suffixes=('_left', '_right'))
  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
Traceback (most recent call last):
...
ValueError: columns overlap but no suffix specified:
    Index(['value'], dtype='object')

>>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
>>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
>>> df1
      a  b
0   foo  1
1   bar  2
>>> df2
      a  c
0   foo  3
1   baz  4

>>> df1.merge(df2, how='inner', on='a')
      a  b  c
0   foo  1  3

>>> df1.merge(df2, how='left', on='a')
      a  b  c
0   foo  1  3.0
1   bar  2  NaN

>>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
>>> df2 = pd.DataFrame({'right': [7, 8]})
>>> df1
    left
0   foo
1   bar
>>> df2
    right
0   7
1   8

>>> df1.merge(df2, how='cross')
   left  right
0   foo      7
1   foo      8
2   bar      7
3   bar      8
File:      ~/opt/anaconda3/lib/python3.8/site-packages/pandas/core/reshape/merge.py
Type:      function

In [22]:
pd.merge(df3, df4, how = 'right')

  calisanlar      grup  ilk_giris
0        Ali  Muhasebe       2010
1       Veli       Muh       2009
2       Ayse       Muh       2014
3      Fatma        IK       2019

## coktan teke (many to one)

In [46]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muh', 'IK'],
                    'mudur': ['Caner', 'Mustafa', 'Berkcan']})
df5

       grup    mudur
0  Muhasebe    Caner
1       Muh  Mustafa
2        IK  Berkcan

In [47]:
df_m

  calisanlar      grup  ilk_giris
0        Ali  Muhasebe       2010
1       Veli       Muh       2009
2       Ayse       Muh       2014
3      Fatma        IK       2019

In [49]:
pd.merge(df_m, df5)

  calisanlar      grup  ilk_giris    mudur
0        Ali  Muhasebe       2010    Caner
1       Veli       Muh       2009  Mustafa
2       Ayse       Muh       2014  Mustafa
3      Fatma        IK       2019  Berkcan

## Coktan Coka (many to many)

In [53]:
df6 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe',
                              'Muh', 'Muh', 'IK', 'IK'],
                    'yetenekler': ['matematik', 'excel', 'kodlama', 'linux',
                               'excel', 'yonetim']})
df6

       grup yetenekler
0  Muhasebe  matematik
1  Muhasebe      excel
2       Muh    kodlama
3       Muh      linux
4        IK      excel
5        IK    yonetim

In [50]:
df3

  calisanlar      grup
0        Ali  Muhasebe
1       Veli       Muh
2       Ayse       Muh
3      Fatma        IK

In [52]:
pd.merge(df3, df6)

  calisanlar      grup yetenekler
0        Ali  Muhasebe  matematik
1        Ali  Muhasebe      excel
2       Veli       Muh    kodlama
3       Veli       Muh      linux
4       Ayse       Muh    kodlama
5       Ayse       Muh      linux
6      Fatma        IK      excel
7      Fatma        IK    yonetim

# Toplulastirma ve Gruplama (Aggregation & Grouping)

Basit toplulastirma fonksiyonlari

* count()         ------------------------ _**describe**_()
* first()         ------------------------ _**dropna**_()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [55]:
import seaborn as sns

In [59]:
df = sns.load_dataset('planets')
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [60]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      ~/opt/anaconda3/lib/python3.8/site-packages/seaborn/utils.py
Type:      function

In [61]:
df.shape # 1035 satir , 6 sutun var [1035 rows X 6 columns]

(1035, 6)

In [65]:
df.mean()

/var/folders/ht/tcz99qld7qz6stv5g043rfyc0000gn/T/ipykernel_3344/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [67]:
df['mass'].mean()

2.6381605847953233

In [69]:
df['mass'].count()

513

In [70]:
df['mass'].min()

0.0036

In [71]:
df['mass'].max()

25.0

In [72]:
df['mass'].sum()

1353.37638

In [81]:
df['mass'].std()

3.8186166509616046

In [82]:
df['mass'].var()

14.58183312700122

In [83]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [84]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [85]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [95]:
df.count()-df.dropna().count()

method            537
number            537
orbital_period    494
mass               15
distance          310
year              537
dtype: int64

# Gruplama Islemleri

In [99]:
df = pd.DataFrame({'gruplar' : ['A', 'B', 'C', 'A', 'B', 'C'],
                   'veri' : [10,11,52,23,43,55]}, columns = ['gruplar', 'veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [103]:
df1 = pd.DataFrame({'gruplar' : ['A', 'B', 'C', 'A', 'B', 'C'],
                   'veri' : [10,11,52,23,43,55]})
df1

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [104]:
df.groupby('gruplar')  #=====> e ne yapayim diye soruyor

In [105]:
df.groupby('gruplar').mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [106]:
df.groupby('gruplar').sum()

         veri
gruplar
A          33
B          54
C         107

In [107]:
df = sns.load_dataset('planets')
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [110]:
df.groupby('method')['orbital_period'].mean() # Neye gore gruplanacak(method) ve Degisken secilir (orbital_period)

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [111]:
df.groupby('method')['orbital_period'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

In [113]:
dfg = sns.load_dataset('iris')
dfg.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [119]:
dfg.groupby('species')[['sepal_length', 'sepal_width']].mean()

            sepal_length  sepal_width
species
setosa             5.006        3.428
versicolor         5.936        2.770
virginica          6.588        2.974

In [120]:
dfg.groupby('species')[['sepal_length', 'sepal_width', 'petal_length', 'petal_width']].mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [122]:
dfg.groupby('species')[['sepal_length', 'sepal_width', 'petal_length', 'petal_width']].std()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          0.352490     0.379064      0.173664     0.105386
versicolor      0.516171     0.313798      0.469911     0.197753
virginica       0.635880     0.322497      0.551895     0.274650

In [123]:
dfg.groupby('species').describe()

           sepal_length                                              \
                  count   mean       std  min    25%  50%  75%  max
species
setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal_width         ... petal_length      petal_width         \
                 count   mean  ...          75%  max       count   mean
species                        ...
setosa            50.0  3.428  ...        1.575  1.9        50.0  0.246
versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
species
setosa      0.105386  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

# Ileri Toplulastirma islemleri (Aggregate, Filter, Transform, Apply)

In [125]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

## Aggregate

In [127]:
df.groupby('method')['orbital_period'].aggregate([min, 'max', np.median]) # ===> Pandas fonklari '' ve direkt calisir

                                       min            max        median
method
Astrometry                      246.360000    1016.000000    631.180000
Eclipse Timing Variations      1916.250000   10220.000000   4343.500000
Imaging                        4639.150000  730000.000000  27500.000000
Microlensing                   1825.000000    5100.000000   3300.000000
Orbital Brightness Modulation     0.240104       1.544929      0.342887
Pulsar Timing                     0.090706   36525.000000     66.541900
Pulsation Timing Variations    1170.000000    1170.000000   1170.000000
Radial Velocity                   0.736540   17337.500000    360.200000
Transit                           0.355000     331.600590      5.714932
Transit Timing Variations        22.339500     160.000000     57.011000

In [135]:
df.groupby('method')[['orbital_period', 'mass']].aggregate(['mean', 'median', 'sum' ])

                              orbital_period                              \
                                        mean        median           sum
method
Astrometry                        631.180000    631.180000  1.262360e+03
Eclipse Timing Variations        4751.644444   4343.500000  4.276480e+04
Imaging                        118247.737500  27500.000000  1.418973e+06
Microlensing                     3153.571429   3300.000000  2.207500e+04
Orbital Brightness Modulation       0.709307      0.342887  2.127920e+00
Pulsar Timing                    7343.021201     66.541900  3.671511e+04
Pulsation Timing Variations      1170.000000   1170.000000  1.170000e+03
Radial Velocity                   823.354680    360.200000  4.553151e+05
Transit                            21.102073      5.714932  8.377523e+03
Transit Timing Variations          79.783500     57.011000  2.393505e+02

                                   mass
                                   mean median         sum
method
Astrometry                          NaN    NaN     0.00000
Eclipse Timing Variations      5.125000  5.125    10.25000
Imaging                             NaN    NaN     0.00000
Microlensing                        NaN    NaN     0.00000
Orbital Brightness Modulation       NaN    NaN     0.00000
Pulsar Timing                       NaN    NaN     0.00000
Pulsation Timing Variations         NaN    NaN     0.00000
Radial Velocity                2.630699  1.260  1341.65638
Transit                        1.470000  1.470     1.47000
Transit Timing Variations           NaN    NaN     0.00000

In [139]:
df.groupby('method')[['orbital_period', 'mass']].aggregate(['describe', min])

                              orbital_period                                \
                                    describe
                                       count           mean            std
method
Astrometry                               2.0     631.180000     544.217663
Eclipse Timing Variations                9.0    4751.644444    2499.130945
Imaging                                 12.0  118247.737500  213978.177277
Microlensing                             7.0    3153.571429    1113.166333
Orbital Brightness Modulation            3.0       0.709307       0.725493
Pulsar Timing                            5.0    7343.021201   16313.265573
Pulsation Timing Variations              1.0    1170.000000            NaN
Radial Velocity                        553.0     823.354680    1454.926210
Transit                                397.0      21.102073      46.185893
Transit Timing Variations                3.0      79.783500      71.599884

                                                                       \

                                       min          25%           50%
method
Astrometry                      246.360000   438.770000    631.180000
Eclipse Timing Variations      1916.250000  2900.000000   4343.500000
Imaging                        4639.150000  8343.900000  27500.000000
Microlensing                   1825.000000  2375.000000   3300.000000
Orbital Brightness Modulation     0.240104     0.291496      0.342887
Pulsar Timing                     0.090706    25.262000     66.541900
Pulsation Timing Variations    1170.000000  1170.000000   1170.000000
Radial Velocity                   0.736540    38.021000    360.200000
Transit                           0.355000     3.160630      5.714932
Transit Timing Variations        22.339500    39.675250     57.011000

                                                                           \
                                                                      min
                                        75%            max orbital_period
method
Astrometry                       823.590000    1016.000000     246.360000
Eclipse Timing Variations       5767.000000   10220.000000    1916.250000
Imaging                        94250.000000  730000.000000    4639.150000
Microlensing                    3550.000000    5100.000000    1825.000000
Orbital Brightness Modulation      0.943908       1.544929       0.240104
Pulsar Timing                     98.211400   36525.000000       0.090706
Pulsation Timing Variations     1170.000000    1170.000000    1170.000000
Radial Velocity                  982.000000   17337.500000       0.736540
Transit                           16.145700     331.600590       0.355000
Transit Timing Variations        108.505500     160.000000      22.339500

                                  mass                                       \
                              describe
                                 count      mean       std     min      25%
method
Astrometry                         0.0       NaN       NaN     NaN      NaN
Eclipse Timing Variations          2.0  5.125000  1.308148  4.2000  4.66250
Imaging                            0.0       NaN       NaN     NaN      NaN
Microlensing                       0.0       NaN       NaN     NaN      NaN
Orbital Brightness Modulation      0.0       NaN       NaN     NaN      NaN
Pulsar Timing                      0.0       NaN       NaN     NaN      NaN
Pulsation Timing Variations        0.0       NaN       NaN     NaN      NaN
Radial Velocity                  510.0  2.630699  3.825883  0.0036  0.22525
Transit                            1.0  1.470000       NaN  1.4700  1.47000
Transit Timing Variations          0.0       NaN       NaN     NaN      NaN


                                                        min
                                 50%     75%    max    mass
method
Astrometry                       NaN     NaN    NaN     NaN
Eclipse Timing Variations      5.125  5.5875   6.05  4.2000
Imaging                          NaN     NaN    NaN     NaN
Microlensing                     NaN     NaN    NaN     NaN
Orbital Brightness Modulation    NaN     NaN    NaN     NaN
Pulsar Timing                    NaN     NaN    NaN     NaN
Pulsation Timing Variations      NaN     NaN    NaN     NaN
Radial Velocity                1.260  3.0000  25.00  0.0036
Transit                        1.470  1.4700   1.47  1.4700
Transit Timing Variations        NaN     NaN    NaN     NaN

In [142]:
df.groupby('method').aggregate({'orbital_period' :[min, max] ,
                                'distance' : ['std', np.median]} )

                              orbital_period                    distance  \
                                         min            max          std
method
Astrometry                        246.360000    1016.000000     4.094148
Eclipse Timing Variations        1916.250000   10220.000000   213.203907
Imaging                          4639.150000  730000.000000    53.736817
Microlensing                     1825.000000    5100.000000  2076.611556
Orbital Brightness Modulation       0.240104       1.544929     0.000000
Pulsar Timing                       0.090706   36525.000000          NaN
Pulsation Timing Variations      1170.000000    1170.000000          NaN
Radial Velocity                     0.736540   17337.500000    45.559381
Transit                             0.355000     331.600590   913.876990
Transit Timing Variations          22.339500     160.000000   915.819487


                                 median
method
Astrometry                       17.875
Eclipse Timing Variations       315.360
Imaging                          40.395
Microlensing                   3840.000
Orbital Brightness Modulation  1180.000
Pulsar Timing                  1200.000
Pulsation Timing Variations         NaN
Radial Velocity                  40.445
Transit                         341.000
Transit Timing Variations       855.000